Table of Contents
 Interface IIdentifier
Namespace
IdeaStatiCa.BimApiLink.Identifiers
Assembly
IdeaStatiCa.BimApiLink.dll
public interface IIdentifier : IIdeaPersistenceToken, IEquatable<IIdentifier>
Inherited Members
 IEquatable<IIdentifier>.Equals(IIdentifier)
Properties
 ObjectType
Type ObjectType { get; }
Property Value
Type
Methods
 GetId()
object GetId()
Returns
object
 GetStringId()
string GetStringId()
Returns
string
 Edit this page